
tags:  #binary_search #math

---

## Условие задачи

Даны две бесконечные возрастающие последовательности:
- **A**: i-й член равен $i^2$ (квадраты натуральных чисел)
- **B**: i-й член равен $i^3$ (кубы натуральных чисел)

Требуется найти $C_x$, где $C$ — возрастающая последовательность, полученная объединением $A$ и $B$ без дубликатов (если число встречается в обеих последовательностях, в $C$ оно попадает один раз).

**Входные данные:** натуральное число $x$ ($1 \le x \le 10^7$).

**Выходные данные:** значение $C_x$.

Примеры:
- $x = 1 → C_1 = 1$
- $x = 2 → C_2 = 4$
- $x = 4 → C_4 = 9$

---

## Идея решения

Прямое построение последовательности невозможно из-за огромных значений (до $10^{14}$). Вместо этого применим бинарный поиск по значению** элемента.

Нам нужно найти наименьшее число $N$ такое, что количество элементов в объединённой последовательности, не превосходящих $N$, равно $x$. Однако искать напрямую по $N$ неудобно, так как $N$ может быть очень большим. Вместо этого заметим, что все квадраты имеют вид $k^2$. Будем искать такое целое $k$, что количество элементов $\le k^2$ равно или превышает $x$. Тогда ответ будет либо $k^2$, либо некоторый куб, меньший $k^2$.

### Ключевая формула

Для целого $k$ количество чисел в объединении $A$ и $B$, не превосходящих $k^2$, равно:

$$
\text{count}(k) = k + \left\lfloor k^{2/3} \right\rfloor - \left\lfloor k^{1/3} \right\rfloor
$$

где:
- $k$ — количество квадратов $1^2, 2^2, \dots, k^2$;
- $\lfloor k^{2/3} \rfloor$ — количество кубов, не превосходящих $k^2$ (так как $j^3 \le k^2 \Leftrightarrow j \le k^{2/3}$);
- $\lfloor k^{1/3} \rfloor$ — количество чисел, являющихся одновременно квадратами и кубами (т.е. шестых степеней), которые были учтены дважды; их надо вычесть.

Функция $\text{count}(k)$ монотонно возрастает с ростом $k$, что позволяет использовать бинарный поиск.

### Вычисление кубического корня

Для вычисления $\lfloor k^{2/3} \rfloor$ и $\lfloor k^{1/3} \rfloor$ нужна функция целочисленного кубического корня. Она реализуется бинарным поиском:

```python
def cubic_root(x: int) -> int:
    left, right = 0, x
    while left <= right:
        mid = (left + right) // 2
        if mid ** 3 <= x:
            left = mid + 1
        else:
            right = mid - 1
    return left - 1
```

### Бинарный поиск по $k$

Ищем минимальное $k$ такое, что $\text{count}(k) \ge x$. Поскольку $x \le 10^7$, можно оценить верхнюю границу $k$. Например, $k = x$ заведомо достаточно, так как квадратов уже $x$ (но они могут быть перемешаны с кубами, поэтому $k$ может быть чуть больше). В коде верхняя граница взята как $x+1$.

После нахождения $k$ возможны два случая:
- Если $\text{count}(k) = x$, то искомый элемент — это $k^2$.
- Если $\text{count}(k) > x$, то элемент — это куб, лежащий в интервале $( (k-1)^2, k^2 ]$. В этом интервале может быть не более одного куба (доказывается анализом роста функций), и этот куб равен $\left( \lfloor k^{2/3} \rfloor \right)^3$. Именно это значение возвращается.

---

## Реализация

```python
def cubic_root(x: int) -> int:
    """Целочисленный кубический корень (наибольшее целое, куб которого ≤ x)"""
    left, right = 0, x
    while left <= right:
        mid = (left + right) // 2
        if mid ** 3 <= x:
            left = mid + 1
        else:
            right = mid - 1
    return left - 1

def count(k: int) -> int:
    """Количество элементов в объединении, не превосходящих k^2"""
    return k + cubic_root(k ** 2) - cubic_root(k)

def solve(x: int) -> int:
    left, right = 1, x + 1  # правую границу можно взять с запасом
    while left < right:
        mid = (left + right) // 2
        if count(mid) >= x:
            right = mid
        else:
            left = mid + 1

    if count(left) == x:
        return left ** 2
    else:
        # наибольший куб, не превосходящий left^2
        return cubic_root(left ** 2) ** 3

if __name__ == "__main__":
    print(solve(int(input())))
```

---

## Анализ сложности

- Бинарный поиск по $k$ выполняется за $O(\log x)$ итераций.
- На каждой итерации вызывается $\text{count}$, которая дважды вычисляет кубический корень через бинарный поиск за $O(\log x)$.
- Итоговая сложность: $O(\log^2 x)$, что при $x \le 10^7$ выполняется мгновенно.

---

## Примеры работы

| x   | count(k) для найденного k | Ответ                 |
| --- | ------------------------- | --------------------- |
| 1   | k=1, count(1)=1           | 1² = 1                |
| 2   | k=2, count(2)=2           | 2² = 4                |
| 3   | k=3, count(3)=4 > 3, куб  | (⌊3^{2/3}⌋)³ = 2³ = 8 |
| 4   | k=3, count(3)=4           | 3² = 9                |

---