
tags: #stack

---

## Условие задачи

Дано арифметическое выражение в **инфиксной** записи, содержащее:
- целые числа;
- однобуквенные переменные (строчные латинские буквы);
- бинарные операции `+`, `-`, `*`, `/` (деление вещественное);
- унарные функции `sin`, `cos`, `abs`, `sqrt`;
- круглые скобки.

Значения переменных задаются в отдельных строках вида `x=5`. Требуется вычислить значение выражения с точностью до трёх знаков после запятой. Выражение гарантированно корректно.

**Входные данные:**
- Первая строка: инфиксное выражение.
- Следующие строки: определения переменных (по одному на строку, имя=значение).

**Выходные данные:** значение выражения с тремя знаками в дробной части.

**Пример:**

| Вход                                                                                 | Выход    |
|--------------------------------------------------------------------------------------|----------|
| `cos(z+abs(sqrt(r*sin(x+4))))`<br>`r=5`<br>`z=10`<br>`x=3`                           | `0.729`  |

---

## Идея решения

Для вычисления инфиксного выражения используется **алгоритм сортировочной станции** с одновременным вычислением. В отличие от преобразования в постфиксную запись с последующим вычислением, здесь значения вычисляются на лету, сохраняя результат в стеке операндов.

Используются два стека:
- `stack` – стек операндов (чисел).
- `ops` – стек операторов и функций.

Алгоритм проходит по строке слева направо и обрабатывает:
- **Числа** – сразу помещаются в стек операндов.
- **Переменные** – их значение из словаря подставляется в стек операндов.
- **Функции** (`sin`, `cos`, `abs`, `sqrt`) – помещаются в стек операторов (как функции). Они распознаются по буквам и последующей `(`.
- **Левая скобка** `(` – помещается в стек операторов.
- **Правая скобка** `)` – вызывает вычисление всех операторов до соответствующей левой скобки, а затем применяет функцию (если она была перед скобкой).
- **Бинарный оператор** (`+`, `-`, `*`, `/`) – выталкивает из стека операторов все операторы с приоритетом **≥** приоритета текущего (левоассоциативность), затем текущий оператор помещается в стек.

После обработки строки все оставшиеся операторы применяются к операндам.

**Приоритеты:**
- `+`, `-` → 1
- `*`, `/` → 2
- Функции (`sin`, `cos`, `abs`, `sqrt`) считаются операторами с высоким приоритетом (3), но они не участвуют в сравнении с бинарными операторами — они выталкиваются только при закрытии скобки.

---

## Алгоритм

1. Создать словарь `vars` из строк переменных (имя → значение).
2. Создать два стека: `stack` (операнды) и `ops` (операторы/функции).
3. Пройти по строке выражения, обрабатывая каждый символ:
   - **Цифра** – прочитать всё число (последовательность цифр), преобразовать в `int` и поместить в `stack`.
   - **Буква** – прочитать имя переменной или функции:
     - Если после букв идёт `(`, то это функция (например, `sin`). Поместить её в `ops` (как строку, включая скобку? обычно только имя).
     - Иначе – переменная. Подставить её значение из `vars` в `stack`.
   - **Левая скобка** `(` – поместить в `ops`.
   - **Правая скобка** `)` – выталкивать операторы из `ops` в стек и применять их к операндам, пока не встретится `(`. Затем удалить `(`. Если после этого вершина стека `ops` — функция (например, `sin`), применить её к одному операнду.
   - **Бинарный оператор** – выталкивать операторы с приоритетом **≥** приоритета текущего, пока они есть, затем текущий оператор поместить в `ops`.
4. После завершения строки вытолкнуть все оставшиеся операторы из `ops` и применить к операндам.
5. Результат – единственное число в `stack`. Вывести его с тремя знаками после запятой.

---

## Реализация на Python

Приведённый код пользователя реализует описанный алгоритм. Важные моменты:

- **Функции распознаются** по шаблону `word + '('` (например, `sin(`). В стек `ops` кладётся `"sin("`, чтобы потом при закрытии скобки знать, что нужно применить функцию.
- В словаре `func_dict` для каждой функции хранится соответствующая функция из `math` (или `abs`). Для `"("` добавлен заглушечный `lambda x: x`.
- При обработке `)`:
  1. Сначала применяются все бинарные операторы до `(`.
  2. Затем из `ops` извлекается последний элемент, который должен быть `"("` (или функцией). Если это функция, то из `stack` извлекается один операнд, применяется функция, результат кладётся обратно в `stack`.
- Приоритет операторов задаётся словарём `priority`.

```python
import sys
import math
from collections import deque

def evaluate_infix_expression():
    # Чтение первой строки — выражения
    expr = sys.stdin.readline().strip()
    # Чтение остальных строк — переменных
    vars = {}
    for line in sys.stdin:
        if '=' in line:
            name, val = line.strip().split('=')
            vars[name] = int(val)

    priority = {'+': 1, '-': 1, '*': 2, '/': 2}
    stack = []          # стек операндов
    ops = []            # стек операторов и функций
    i = 0
    n = len(expr)

    def apply_op(a, b, op):
        if op == '+': return a + b
        if op == '-': return a - b
        if op == '*': return a * b
        if op == '/': return a / b

    func_dict = {
        'sin(': math.sin,
        'cos(': math.cos,
        'abs(': abs,
        'sqrt(': math.sqrt,
        '(': lambda x: x
    }

    while i < n:
        ch = expr[i]
        if ch.isdigit():
            num = 0
            while i < n and expr[i].isdigit():
                num = num * 10 + int(expr[i])
                i += 1
            stack.append(num)
            continue

        if ch.isalpha():
            word = ''
            while i < n and expr[i].isalpha():
                word += expr[i]
                i += 1
            # Если после слова идёт '(', то это функция
            if i < n and expr[i] == '(':
                func_name = word + '('
                ops.append(func_name)
                i += 1  # пропускаем '('
            else:
                # Переменная
                stack.append(vars[word])
            continue

        if ch in priority:
            # Выталкиваем операторы с приоритетом ≥ текущего
            while (ops and ops[-1] in priority and
                   priority[ops[-1]] >= priority[ch]):
                b = stack.pop()
                a = stack.pop()
                op = ops.pop()
                stack.append(apply_op(a, b, op))
            ops.append(ch)
        elif ch == '(':
            ops.append(ch)
        elif ch == ')':
            # Применяем все бинарные операторы до '('
            while ops and ops[-1] in priority:
                b = stack.pop()
                a = stack.pop()
                op = ops.pop()
                stack.append(apply_op(a, b, op))
            # Теперь на вершине ops должна быть '(' или функция
            op = ops.pop()
            if op in func_dict and op != '(':
                arg = stack.pop()
                stack.append(func_dict[op](arg))
        i += 1

    # Применяем оставшиеся операторы
    while ops:
        op = ops.pop()
        if op in priority:
            b = stack.pop()
            a = stack.pop()
            stack.append(apply_op(a, b, op))
        else:
            # функции уже обработаны, но на всякий случай
            arg = stack.pop()
            stack.append(func_dict[op](arg))

    result = stack.pop()
    # Округление до 3 знаков (в коде используется round, но для вывода можно f-string)
    print(f"{result:.3f}")

if __name__ == "__main__":
    evaluate_infix_expression()
```

---

## Сложность

- **Время:** O(n), где n – длина строки выражения. Каждый символ обрабатывается один раз, операции со стеками — O(1) в среднем.
- **Память:** O(n) для хранения стеков.

---