
tags: #stack

---

## Условие задачи

Дано арифметическое выражение в **инфиксной** записи (операторы между операндами), содержащее целые числа, знаки операций `+`, `-`, `*`, `/` и круглые скобки. Требуется преобразовать его в **постфиксную** (обратную польскую) запись.

**Входные данные:** одна строка с корректным инфиксным выражением.

**Выходные данные:** строка с постфиксной записью, элементы разделены пробелами.

**Пример:**
```
Вход: (5+23*16)/(8-28*(9+34)/5)
Выход: 5 23 16 * + 8 28 9 34 + * 5 / - /
```

---

## Идея решения

Для преобразования используется **алгоритм сортировочной станции** (Shunting‑yard algorithm) Эдсгера Дейкстры. Алгоритм основан на стеке операторов и правильном порядке выталкивания операторов в выходную строку.

### Основные правила

1. **Операнды** (числа) сразу добавляются в выходную строку.
2. **Левая скобка** `(` помещается в стек.
3. **Правая скобка** `)` выталкивает операторы из стека в выходную строку до встречи левой скобки (сама скобка удаляется).
4. **Оператор** выталкивает из стека в выход все операторы с приоритетом, **большим или равным** приоритету текущего оператора (левоассоциативные), затем текущий оператор помещается в стек.
5. По окончании чтения выталкиваются все оставшиеся в стеке операторы.

Приоритеты:
- `+`, `-` → 1
- `*`, `/` → 2

---

## Алгоритм

1. Инициализировать пустой стек `stack` и список `output`.
2. Пройти по строке выражения слева направо, обрабатывая каждый символ:
   - Если символ — цифра, то прочитать всё число (последовательность цифр) и добавить его в `output`.
   - Если символ — `(`, поместить в стек.
   - Если символ — `)`, выталкивать элементы из стека в `output`, пока не встретится `(`; затем удалить `(` из стека.
   - Если символ — оператор (`+`, `-`, `*`, `/`):
     - Пока стек не пуст и на вершине стека находится оператор с приоритетом **≥** приоритета текущего оператора, выталкивать его в `output`.
     - Поместить текущий оператор в стек.
3. После обработки всего выражения вытолкнуть все оставшиеся операторы из стека в `output`.
4. Вывести элементы `output` через пробел.

---

## Реализация на Python (базовая, без функций)

```python
def infix_to_postfix(expr):
    priority = {'+': 1, '-': 1, '*': 2, '/': 2}
    stack = []
    output = []
    i = 0
    n = len(expr)

    while i < n:
        ch = expr[i]
        if ch.isdigit():
            num = []
            while i < n and expr[i].isdigit():
                num.append(expr[i])
                i += 1
            output.append(''.join(num))
            continue  # i уже увеличен
        elif ch == '(':
            stack.append(ch)
        elif ch == ')':
            while stack and stack[-1] != '(':
                output.append(stack.pop())
            stack.pop()  # удаляем '('
        elif ch in priority:
            while (stack and stack[-1] in priority and
                   priority[stack[-1]] >= priority[ch]):
                output.append(stack.pop())
            stack.append(ch)
        i += 1

    while stack:
        output.append(stack.pop())

    return ' '.join(output)

# Пример использования
expr = "(5+23*16)/(8-28*(9+34)/5)"
print(infix_to_postfix(expr))
# Вывод: 5 23 16 * + 8 28 9 34 + * 5 / - /
```

---

## Сложность

- **Время:** O(n), где n — длина строки. Каждый символ обрабатывается один раз, и операции со стеком выполняются за O(1) в среднем.
- **Память:** O(n) для хранения стека и выходного списка.

---