
tags: #stack #postfix #expression #calculation #functions

---

## Условие задачи

Дано арифметическое выражение, записанное в **постфиксной форме** (обратная польская запись), с возможностью использования:

- целых чисел;
- имён переменных (одна строчная латинская буква);
- бинарных операций: `+`, `-`, `*`, `/` (обычное деление, результат — вещественное число);
- унарных функций: `abs`, `sin`, `cos`, `sqrt`.

Переменные задаются в отдельных строках вида `x=5`. Необходимо вычислить значение выражения с точностью до трёх знаков после запятой. Если выражение некорректно (недостаток операндов, лишние операнды в конце, неизвестная операция/функция), вывести `ERROR`.

**Входные данные:**
- Первая строка: элементы постфиксного выражения, разделённые пробелами.
- Следующие строки: определения переменных (каждая в формате `<имя>=<значение>`). Имена переменных — одна буква.

**Выходные данные:** значение выражения с тремя десятичными знаками (например, `9.986`) или слово `ERROR`.

**Примеры:**

| Вход                                                                     | Выход    |
|--------------------------------------------------------------------------|----------|
| `5 c sqrt + 4 sin z cos sqrt + 1 - / abs`<br>`c=15`<br>`z=7`             | `9.986`  |
| `5 sin c cos + 4 z sqrt + 1 -`<br>`c=15`<br>`z=7`                        | `ERROR`  |

---

## Идея решения

Постфиксная запись вычисляется с помощью **стека**:
- Операнды (числа, значения переменных) помещаются в стек.
- При встрече оператора или функции из стека извлекаются нужные операнды, выполняется операция, результат помещается обратно в стек.
- В конце в стеке должен остаться один элемент — результат.

Для унарных функций (sin, cos, abs, sqrt) извлекается один аргумент, для бинарных операций — два (первый извлечённый — правый операнд, второй — левый). Деление выполняется как обычное вещественное деление.

Важно обрабатывать ошибки:
- если оператору не хватает операндов (стек пуст);
- если после вычисления в стеке осталось больше одного значения;
- если неизвестная операция или функция;
- если переменная не определена.

---

## Алгоритм

1. **Чтение входных данных:**
   - Первая строка `seq` — список элементов выражения.
   - Остальные строки читаются, из них формируется словарь `vars`: имя переменной → значение (целое).

2. **Создать стек** (например, `collections.deque` или обычный список).

3. **Обход элементов выражения:**
   - Если элемент — **оператор/функция** (ключ в словаре `func_dict`), вызываем соответствующую функцию, которая:
     - Извлекает из стека нужное количество аргументов (1 для унарных, 2 для бинарных).
     - Вычисляет результат.
     - Помещает результат в стек.
   - Если элемент — **переменная** (ключ в `vars`), помещаем в стек её значение.
   - Если элемент — **число** (можно преобразовать в `int`), помещаем в стек.
   - В противном случае — ошибка.

4. **Проверка корректности:**
   - После обхода всех элементов в стеке должен быть **ровно один** элемент. Если стек пуст или содержит более одного значения — ошибка.
   - Любое исключение при выполнении операций (деление на ноль, неверная операция, недостаток операндов) перехватывается и трактуется как `ERROR`.

5. **Вывод:**
   - Если всё успешно — вывести значение с тремя знаками после запятой: `f"{result:.3f}"`.
   - Иначе — `"ERROR"`.

---

## Реализация на Python

```python
import sys
import math
from collections import deque

def evaluate_postfix_expression():
    # Чтение всего ввода
    lines = [line.strip() for line in sys.stdin.readlines() if line.strip()]
    if not lines:
        print("ERROR")
        return

    # Первая строка — выражение
    tokens = lines[0].split()

    # Остальные строки — переменные
    var_dict = {}
    for line in lines[1:]:
        if '=' in line:
            name, val = line.split('=')
            var_dict[name] = int(val)

    # Определение операций и функций
    stack = deque()

    def add():
        b = stack.pop()
        a = stack.pop()
        stack.append(a + b)

    def sub():
        b = stack.pop()
        a = stack.pop()
        stack.append(a - b)

    def mul():
        b = stack.pop()
        a = stack.pop()
        stack.append(a * b)

    def div():
        b = stack.pop()
        a = stack.pop()
        stack.append(a / b)

    def _abs():
        a = stack.pop()
        stack.append(abs(a))

    def _sin():
        a = stack.pop()
        stack.append(math.sin(a))

    def _cos():
        a = stack.pop()
        stack.append(math.cos(a))

    def _sqrt():
        a = stack.pop()
        stack.append(math.sqrt(a))

    func_dict = {
        '+': add,
        '-': sub,
        '*': mul,
        '/': div,
        'abs': _abs,
        'sin': _sin,
        'cos': _cos,
        'sqrt': _sqrt,
    }

    # Вычисление
    try:
        for token in tokens:
            if token in func_dict:
                func_dict[token]()
            elif token in var_dict:
                stack.append(var_dict[token])
            else:
                # Попробуем преобразовать в число
                try:
                    num = int(token)
                    stack.append(num)
                except ValueError:
                    raise ValueError(f"Invalid token: {token}")

        # После обработки в стеке должен быть один элемент
        if len(stack) != 1:
            raise ValueError("Invalid expression")

        result = stack.pop()
        print(f"{result:.3f}")

    except Exception:
        print("ERROR")

if __name__ == "__main__":
    evaluate_postfix_expression()
```

### Пояснения к коду

- **Функции-обработчики** используют замыкание на стек. Они извлекают операнды в порядке: сначала правый операнд, потом левый.
- `func_dict` сопоставляет имя операции/функции с соответствующей функцией.
- Исключение `ValueError` перехватывается, и в ответ выводится `ERROR`.
- После вычислений проверяется размер стека, чтобы убедиться, что не осталось лишних операндов.

---

## Сложность

- **Время:** O(N), где N — количество токенов в выражении.
- **Память:** O(N) в худшем случае (глубина стека).

---