
tags: #graph #adjacency-matrix #adjacency-list #conversion

---

## Определение

В теории графов существуют два основных способа представления графа: **матрица смежности** и **список смежности**. Каждый из них удобен в разных ситуациях. Матрица смежности хороша для плотных графов и быстрой проверки наличия ребра, список смежности — для разреженных графов и эффективного обхода соседей. Преобразование между этими представлениями — частая задача при работе с графами.

---

## Задача 1. Построение списков смежности из матрицы смежности

### Условие

Дан ориентированный граф, заданный матрицей смежности размера `N × N`. Элемент матрицы `a[i][j] = 1`, если существует ребро из вершины `i+1` в вершину `j+1` (нумерация с 1). Требуется для каждой вершины вывести список вершин, в которые ведут исходящие рёбра. Если из вершины нет исходящих рёбер, вывести `0`. Порядок вершин в списке должен быть возрастающим.

**Входные данные:**
- Первая строка: число вершин `N` (1 ≤ N ≤ 1000).
- Далее `N` строк, каждая содержит `N` целых чисел (0 или 1) — матрица смежности.

**Выходные данные:**
- `N` строк: для каждой вершины — список соседей, разделённых пробелами, или `0` для изолированной вершины.

**Пример:**

Вход:
```
5
0 1 1 1 0
1 0 1 0 1
1 1 0 1 0
0 0 0 0 0
0 1 0 1 0
```
Выход:
```
2 3 4
1 3 5
1 2 4
0
2 4
```

### Идея решения

Проходим по строкам матрицы. Для каждой вершины `i` (индекс строки) собираем номера столбцов `j` (сдвинутые на 1), в которых элемент равен 1. Если список пуст, выводим `0`, иначе выводим номера через пробел.

### Реализация

```python
def adjacency_matrix_to_list():
    N = int(input())
    grid = [list(map(int, input().split())) for _ in range(N)]
    for i in range(N):
        # собираем соседей: номера вершин, начиная с 1
        neighbors = [j + 1 for j in range(N) if grid[i][j] == 1]
        if not neighbors:
            print(0)
        else:
            print(*neighbors)
```

**Комментарии:**
- В коде пользователя была дополнительная проверка на пустоту и замена на `[0]`, затем вывод `*row`. Это избыточно, но корректно.
- Внимание: матрица может быть несимметричной (ориентированный граф).

---

## Задача 2. Построение матрицы смежности из списков смежности

### Условие

Дан ориентированный граф, заданный списками смежности. Для каждой вершины `i` (нумерация с 1) перечисляются номера вершин, в которые ведут рёбра. Если из вершины нет рёбер, может быть указана пустая строка или `0` (по условию — пустая строка или `0`? В примере входных данных для изолированной вершины выводится `0`). Требуется восстановить матрицу смежности размера `N × N`, где `a[i][j] = 1` при наличии ребра из `i+1` в `j+1`.

**Входные данные:**
- Первая строка: число вершин `N` (1 ≤ N ≤ 1000).
- Далее `N` строк: для каждой вершины список смежности (номера вершин, разделённые пробелами). Если строка содержит `0` или пуста, значит рёбер нет.

**Выходные данные:**
- `N` строк, каждая содержит `N` чисел (0 или 1) — матрица смежности.

**Пример:**

Вход:
```
5
2 3 4
1 3 5
1 2 4
0
2 4
```
Выход:
```
0 1 1 1 0
1 0 1 0 1
1 1 0 1 0
0 0 0 0 0
0 1 0 1 0
```

### Идея решения

Создаём матрицу `N × N`, заполненную нулями. Для каждой вершины `i` (индекс строки) читаем строку списка. Если первый элемент `0`, пропускаем. Иначе для каждого числа `v` в списке устанавливаем `grid[i][v-1] = 1`. После обработки всех вершин выводим матрицу построчно.

### Реализация

```python
def adjacency_list_to_matrix():
    N = int(input())
    grid = [[0] * N for _ in range(N)]
    for i in range(N):
        row = list(map(int, input().split()))
        if row[0] == 0:
            continue
        for v in row:
            grid[i][v - 1] = 1
    for row in grid:
        print(*row)
```

**Комментарии:**
- Если строка начинается с `0` — рёбер нет, идём дальше.
- Номера вершин преобразуем в индексы (вычитаем 1).
- Для пустой строки (например, в некоторых вариантах задачи) нужно обработать как `row = []`. В приведённом условии строка всегда содержит хотя бы `0`, поэтому проверка `row[0] == 0` работает.

---

## Сложность

Оба преобразования выполняются за O(N²) времени и требуют O(N²) памяти для хранения результата (матрица). Списки смежности экономят память, но их построение из матрицы всё равно требует просмотра всех N² элементов.

- **Время:** O(N²) (просмотр всех элементов матрицы или всех элементов всех списков)
- **Память:** O(N²) для матрицы; для списков смежности — O(N + E) (E — число рёбер).

---