
tags: #graph #connected-components #dfs #matrix

---

## Определение

**Компонента связности** — максимальное подмножество вершин графа, в котором любые две вершины соединены путём. В неориентированном графе это понятие означает, что внутри компоненты можно добраться из любой вершины в любую, а между разными компонентами путей нет. Задача подсчёта количества компонент связности возникает при анализе изолированных кластеров, например, при определении числа независимых государств на острове.

---

## Условие

Задача №112635 с сайта informatics.msk.ru (название «Независимость»).

На острове расположены несколько государств, изолированных друг от друга. Данные обо всех дорогах заданы в виде **весовой матрицы** графа, где узлы – города, а веса рёбер – расстояния между ними. Требуется определить, сколько государств (компонент связности) находится на острове. Наличие дороги между городами определяется ненулевым весом (значение > 0). Веса не влияют на связность, важна только структура.

**Входные данные:**
- Первая строка: число городов `N` (1 ≤ N ≤ 1000).
- Следующие `N` строк: вещественная или целочисленная матрица `N × N`, где элемент `a[i][j] ≠ 0` означает наличие дороги между городами `i+1` и `j+1`. Матрица симметрична (граф неориентированный).

**Выходные данные:** одно целое число — количество компонент связности.

**Пример:**

Вход:
```
5
0 6 3 0 0
6 0 8 0 0
3 8 0 0 0
0 0 0 0 7
0 0 0 7 0
```
Выход:
```
2
```
(Вершины 1–3 образуют одну компоненту, вершины 4–5 — другую.)

---

## Идея решения

Для подсчёта компонент связности нужно обойти все вершины графа. Алгоритм:

1. Подготовить список смежности на основе матрицы (учитывая ненулевые элементы, так как они обозначают рёбра).
2. Использовать массив `visited` для отметки посещённых вершин.
3. Последовательно перебирать вершины. Если текущая вершина ещё не посещена, запустить обход (DFS или BFS) из неё, пометить все достижимые вершины и увеличить счётчик компонент на 1.
4. В конце вывести счётчик.

---

## Реализация

```python
def count_connected_components():
    N = int(input())
    # Читаем матрицу смежности (веса)
    grid = [list(map(int, input().split())) for _ in range(N)]

    # Строим списки смежности: для каждой вершины i запоминаем номера j, где grid[i][j] != 0
    graph = [[j for j in range(N) if grid[i][j] != 0] for i in range(N)]

    visited = [0] * N      # 0 — не посещена, 1 — посещена
    components = 0
    i = 0
    while i < N:
        if visited[i]:      # вершина уже обработана
            i += 1
            continue

        # Запускаем DFS для новой компоненты
        stack = [i]
        while stack:
            v = stack.pop()
            if not visited[v]:
                visited[v] = 1
                # Добавляем соседей в стек (обход в глубину)
                for u in reversed(graph[v]):
                    if not visited[u]:
                        stack.append(u)
        components += 1
        i += 1

    print(components)
```

**Пояснения к коду:**
- `if visited[i]` пропускает уже посещённые вершины.
- Как только найдена непосещённая вершина, начинается обход (стековый DFS). Все достижимые вершины помечаются.
- После завершения обхода счётчик `components` увеличивается на 1, а внешний цикл переходит к следующей вершине.
- `reversed(graph[v])` используется для того, чтобы порядок добавления соседей соответствовал естественному (необязательно).

---

## Сложность

- **Время:** O(N²) — построение списков смежности требует просмотра всех N² элементов матрицы; обход всех вершин и рёбер — O(N + E), где E — число рёбер. В худшем случае E = N², так что общая сложность O(N²).
- **Память:** O(N²) для хранения матрицы (или O(N + E) для списков смежности). Можно сократить память, не строя списки явно, а проверять соседей на лету — тогда дополнительная память O(N) (стек и массив `visited`), но время останется O(N²).

---

## Примечания

- В данной задаче важны только ненулевые элементы матрицы. Веса (расстояния) не влияют на связность, поэтому в списки смежности включаются все вершины `j`, для которых `grid[i][j] != 0`.
- Граф неориентированный (матрица симметрична), но код работает и для ориентированных графов, так как используется только исходящая информация из каждой строки.
- Альтернативный способ — использовать BFS вместо DFS, или применять систему непересекающихся множеств (DSU) для подсчёта компонент. DSU даёт O(N² α(N)) и часто удобнее при работе с рёбрами.
- Для больших N (до 1000) O(N²) допустимо.

---