
tags: #graph #dfs #connectivity #matrix

---

## Определение

**Связность графа** — свойство, означающее, что между любой парой вершин существует путь. В данной задаче требуется проверить более слабое условие: достижимы ли все вершины из первой (вершина с номером 1). Граф задан матрицей смежности, может быть ориентированным.

---

## Условие

Задача №112634 с сайта informatics.msk.ru.

Дорожная карта программиста Васи записана как матрица смежности графа. Нужно определить, верно ли, что из первого города можно проехать во все остальные (не обязательно напрямую).

**Входные данные:**
- Первая строка: число вершин `N` (1 ≤ N ≤ 1000).
- Следующие `N` строк: матрица смежности размера `N × N` (0 или 1).

**Выходные данные:**
- `YES`, если из вершины 1 достижимы все остальные вершины, иначе `NO`.

**Пример 1:**

Вход:
```
5
0 1 1 1 0
1 0 1 0 1
1 1 0 1 0
0 0 0 0 0
0 1 0 1 0
```
Выход: `YES` (из первой вершины можно добраться до всех остальных).

**Пример 2:**

Вход:
```
5
0 1 1 0 0
1 0 1 0 0
1 1 0 0 0
0 0 0 0 1
0 0 0 1 0
```
Выход: `NO` (вершины 4 и 5 образуют отдельную компоненту, недоступную из первой).

---

## Идея решения

Для проверки достижимости из заданной стартовой вершины достаточно выполнить **обход графа** (DFS или BFS) начиная с вершины 1. Если после обхода количество посещённых вершин равно `N`, то все достижимы.

### Алгоритм

1. Построить списки смежности из матрицы (или использовать матрицу напрямую для проверки соседей).
2. Выполнить обход в глубину (или ширину) из вершины 0 (индекс в Python, соответствующий первому городу).
3. Подсчитать количество посещённых вершин.
4. Если посещены все `N` вершин, вывести `YES`, иначе `NO`.

---

## Реализация

```python
def is_graph_connected():
    N = int(input())
    grid = [list(map(int, input().split())) for _ in range(N)]

    # Построение списков смежности (опционально, можно и на лету)
    graph = [[j for j in range(N) if grid[i][j] == 1] for i in range(N)]

    visited = set()
    stack = [0]          # начнём с вершины 0 (первый город)

    while stack:
        v = stack.pop()
        if v not in visited:
            visited.add(v)
            # Обратный порядок для совместимости с исходным кодом (можно без reversed)
            for u in reversed(graph[v]):
                if u not in visited:
                    stack.append(u)

    print("YES" if len(visited) == N else "NO")
```

### Комментарии к коду

- **Списки смежности** строятся явно, но можно обойтись без них, проверяя соседей прямо в матрице. Это не повлияет на сложность.
- **`reversed(graph[v])`** используется для обхода в том же порядке, что и в оригинальном коде. В DFS порядок соседей не важен, но `reversed` делает порядок обхода обратным к естественному (от младших индексов к старшим). Без `reversed` алгоритм также корректен.
- **`visited`** — множество посещённых вершин; можно заменить на массив булевых значений для экономии времени.

### Альтернативная реализация (BFS)

```python
from collections import deque

def is_graph_connected_bfs():
    N = int(input())
    grid = [list(map(int, input().split())) for _ in range(N)]

    visited = [False] * N
    q = deque([0])
    visited[0] = True

    while q:
        v = q.popleft()
        for u in range(N):
            if grid[v][u] == 1 and not visited[u]:
                visited[u] = True
                q.append(u)

    print("YES" if all(visited) else "NO")
```

BFS может быть предпочтительнее для поиска кратчайших расстояний, но здесь достаточно простого обхода.

---

## Сложность

- **Время:** O(N²) — построение списков смежности требует просмотра всей матрицы. Сам обход выполняется за O(N + E), но E ≤ N². В худшем случае O(N²).
- **Память:** O(N²) для хранения матрицы (или списков смежности) плюс O(N) для `visited` и стека/очереди.

Можно сократить память, не строя списки смежности явно, а проверяя соседей на лету — тогда дополнительная память O(N).

---