
tags: #graph #matrix 

---

## Определение

**Изолированная вершина** — вершина графа, которая не соединена рёбрами ни с какой другой вершиной. Степень такой вершины равна 0. В контексте задачи «Изоляция» требуется найти все города (вершины), которые не имеют дорог ни к каким другим городам, то есть являются отдельными государствами из одного города.

---

## Условие

Задача №112636 с сайта informatics.msk.ru.

На острове расположены несколько государств. Данные о дорогах представлены в виде **весовой матрицы** графа (узлы – города, веса – расстояния). Требуется найти все государства, состоящие из единственного города (изолированные вершины).

**Входные данные:**
- Первая строка: число городов `N` (1 ≤ N ≤ 1000).
- Следующие `N` строк: матрица `N × N` вещественных или целых чисел. Элемент `a[i][j] ≠ 0` означает наличие дороги между городами `i+1` и `j+1`. Матрица симметрична (граф неориентированный), на диагонали стоят нули.

**Выходные данные:**
- Номера изолированных вершин в порядке возрастания, разделённые пробелами.
- Если таких вершин нет, вывести `0`.

**Пример:**

Вход:
```
5
0 1 2 0 0
1 0 3 0 0
2 3 0 0 0
0 0 0 0 0
0 0 0 0 0
```
Выход:
```
4 5
```
(Города 4 и 5 не имеют дорог.)

---

## Идея решения

Для каждой вершины `i` (нумерация с 1) проверить, существует ли хотя бы одно ребро, связывающее её с любой другой вершиной. Поскольку граф неориентированный, наличие ребра можно определить, просмотрев все элементы в i-й строке и i-м столбце (кроме диагонали). Если все эти элементы равны нулю, вершина изолирована.

### Алгоритм

1. Считать `N` и матрицу `matrix` (список списков).
2. Создать пустой список `isolated` для хранения номеров изолированных вершин.
3. Для каждой вершины `i` от 0 до `N-1`:
   - Установить флаг `is_isolated = True`.
   - Перебрать `j` от 0 до `N-1`, исключая `j == i`:
     - Если `matrix[i][j] != 0` или `matrix[j][i] != 0`, то флаг сбросить и выйти из цикла.
   - Если после проверки флаг остался `True`, добавить `i+1` в список.
4. Если список не пуст, вывести его элементы через пробел, иначе вывести `0`.

---

## Реализация

```python
def find_isolated_vertices():
    n = int(input())
    matrix = [list(map(int, input().split())) for _ in range(n)]

    isolated = []
    for i in range(n):
        is_isolated = True
        for j in range(n):
            if i != j:
                if matrix[i][j] != 0 or matrix[j][i] != 0:
                    is_isolated = False
                    break
        if is_isolated:
            isolated.append(i + 1)

    if isolated:
        print(*isolated)
    else:
        print(0)
```

**Пояснения:**
- Проверка `matrix[i][j] != 0 or matrix[j][i] != 0` учитывает, что ребро может быть указано как в строке, так и в столбце (гарантия для неориентированного графа, но можно было бы ограничиться только строкой, так как матрица симметрична). В коде пользователя проверка избыточна, но безопасна.
- Диагональные элементы (i == j) пропускаются, так как они обычно нулевые и не влияют на изоляцию.
- Сложность O(N²) — необходимо просмотреть все элементы матрицы.

---

## Оптимизация

Поскольку матрица симметрична, можно проверять только элементы `matrix[i][j]` для `j > i`. Но для простоты и читаемости оставляем полную проверку. На N ≤ 1000 O(N²) вполне допустимо.

---

## Сложность

- **Время:** O(N²) — обход всех элементов матрицы.
- **Память:** O(N²) для хранения матрицы.

---

## Примечания

- Входные данные могут содержать вещественные числа (расстояния). В коде используется `int`, но для корректности лучше использовать `float` или просто проверять на `!= 0` — это работает и для целых, и для вещественных чисел, так как ненулевое значение считается истинным.
- Если в матрице на диагонали могут быть ненулевые значения (что в условии не оговаривается), они не влияют на изоляцию, так как петли (ребро из вершины в себя) не считаются соединением с другой вершиной.
- Вывод `0` при отсутствии изолированных вершин соответствует примеру в условии.

---