
tags: #graph #bfs #bitwise 

---

## Определение

В задаче требуется найти все пары вершин (городов) в неориентированном графе, между которыми существует путь ровно с **K пересадками**. Пересадка — это промежуточная вершина, через которую проходит маршрут. Таким образом, количество рёбер в пути равно `K+1`. Маршрут может проходить через вершины несколько раз (если не запрещено), но в данном решении рассматриваются только простые пути (без повторения вершин), что гарантирует отсутствие циклов и конечность поиска.

---

## Условие

Задача №112637 с сайта informatics.msk.ru («Пересадки»).

**Входные данные:**
- Первая строка: число городов `N` (1 ≤ N ≤ 50).
- Следующие `N` строк: матрица смежности размера `N × N` (0 или 1), где `1` означает наличие прямого рейса между городами.
- Последняя строка: целое число `K` — желаемое количество пересадок.

**Выходные данные:**
- Все пары `(i, j)` (i < j), для которых существует маршрут из `i` в `j` ровно с `K` пересадками.
- Каждая пара выводится в отдельной строке, номера городов (начиная с 1) идут по возрастанию.
- Пары упорядочены по возрастанию первого номера, внутри — по возрастанию второго.
- Если таких пар нет, вывести `0`.

**Пример:**

Вход:
```
4
0 1 1 0
1 0 1 0
1 1 0 1
0 0 1 0
2
```
Выход:
```
1 4
2 4
```
(Из города 1 в город 4: 1→2→3→4 (2 пересадки); из 2 в 4: 2→1→3→4 (2 пересадки).)

---

## Идея решения

Нужно для каждой стартовой вершины `start` найти все вершины `end`, достижимые путём длины `K+1` (ровно `K+1` рёбер), причём путь не должен содержать циклов, иначе можно было бы получить бесконечное количество путей. В коде используется **BFS с битовой маской** для отслеживания посещённых вершин, что гарантирует простоту пути (каждая вершина посещается не более одного раза).

### Алгоритм

1. Считать `N`, матрицу смежности `graph` и `K`.
2. Для каждой стартовой вершины `start` (0..N-1):
   - Создать очередь, в которую помещаем состояние `(vertex, distance, mask)`, где `mask` — битовая маска посещённых вершин (бит `v` установлен, если вершина `v` уже в пути).
   - Начальное состояние: `(start, 0, 1 << start)`.
   - Инициализировать множество `reachable` для хранения конечных вершин (не равных `start`), которые можно достичь за `K+1` шагов.
   - Пока очередь не пуста:
     - Извлечь `(node, dist, mask)`.
     - Если `dist == K+1`:
       - Если `node != start`, добавить `node` в `reachable`.
       - Продолжить (не искать дальше, так как нужна точная длина).
     - Для каждого соседа `nxt`:
       - Если есть ребро `graph[node][nxt] == 1` и бит `nxt` ещё не установлен в `mask` (вершина не посещалась), то добавить в очередь `(nxt, dist+1, mask | (1 << nxt))`.
   - После BFS для каждого `end` в `reachable` (отсортированного) вывести пару `(start+1, end+1)`, если `start < end` (чтобы не дублировать пары).
3. Если ни одной пары не найдено, вывести `0`.

---

## Реализация

```python
from collections import deque

def find_paths_of_length_k():
    n = int(input())
    graph = [list(map(int, input().split())) for _ in range(n)]
    K = int(input())

    found = False
    for start in range(n):
        queue = deque()
        queue.append((start, 0, 1 << start))

        reachable = set()

        while queue:
            node, dist, mask = queue.popleft()

            if dist == K + 1:
                if node != start:
                    reachable.add(node)
                continue

            for nxt in range(n):
                if graph[node][nxt] == 1 and not (mask & (1 << nxt)):
                    queue.append((nxt, dist + 1, mask | (1 << nxt)))

        for end in sorted(reachable):
            if start < end:
                print(start + 1, end + 1)
                found = True

    if not found:
        print(0)
```

---

## Сложность

- **Время:** O(N²·2^N) в худшем случае из-за битовых масок, но при N ≤ 50 это неприемлемо. Однако на практике из-за ограничения длины пути (K+1) и ранней остановки количество состояний сильно ограничено. BFS перебирает все простые пути длины не более K+1, количество которых может быть экспоненциальным, но при K ≤ N-1 и N ≤ 50 это может быть очень медленно. Для N=50 и K=49 возможен перебор всех простых путей, что непрактично. На самом деле, в условии N ≤ 50, но K может быть любым. Более эффективное решение — использование **возведения матрицы смежности в степень** или **динамического программирования по длине пути**.
- **Память:** O(N·2^N) в худшем случае для хранения очереди, но в среднем меньше.

---

## Примечания

- **Битовая маска** гарантирует, что путь не содержит повторяющихся вершин (простой путь). Это ограничение может быть излишним, если допускаются циклы. В примере ответ совпадает, так как простые пути существуют.
- **Нумерация:** в коде вершины индексируются с 0, но на вывод идут номера +1.
- **Сортировка:** `sorted(reachable)` обеспечивает возрастание второго номера; условие `start < end` предотвращает дублирование пар.
- **Граф неориентированный**, но матрица может быть несимметричной (в примере симметрична). Код работает для обоих случаев, так как проверяет только `graph[node][nxt]`.
- Альтернативное решение: возведение матрицы смежности в степень (K+1) и проверка ненулевых элементов.

---