
tags: #graph #bfs

---

## Определение

**Задача о самом длинном пути в ориентированном ациклическом графе (DAG)** заключается в нахождении максимального суммарного веса пути от заданной исходной вершины `src` до всех остальных вершин. Поскольку граф ациклический, можно эффективно решить задачу с помощью динамического программирования на основе топологической сортировки. В отличие от задачи о кратчайшем пути (которая решается алгоритмом Беллмана-Форда или Дейкстры для неотрицательных весов), здесь веса могут быть произвольными (в том числе отрицательными), но отсутствие циклов позволяет применять линейные алгоритмы.

**Пример:**
```
V = 5, src = 1
edges = [[0,1,1], [0,2,2], [1,4,4], [3,2,-1], [4,2,3], [4,3,6]]
Должен получиться массив расстояний: [INF, 0, 9, 10, 4]
```

---

## Постановка задачи

**Входные данные:**
- `V` — количество вершин (0..V-1).
- `edges` — список рёбер `[u, v, w]`, где `w` — вес (может быть отрицательным).
- `src` — исходная вершина.

**Выход:** массив `dist` длины `V`, где `dist[i]` — максимальный суммарный вес пути от `src` к `i`. Если вершина недостижима, значение должно быть `INT_MIN` (или `-inf`). В выводе для наглядности заменяется на `INF`.

**Ограничения:** граф является DAG (нет циклов). Время работы должно быть O(V+E).

---

## Идея решения (топологическая сортировка + DP)

Ключевое свойство DAG: существует **топологический порядок**, в котором все рёбра направлены от вершин, идущих раньше, к вершинам, идущим позже. Поэтому если мы обрабатываем вершины в этом порядке, то к моменту обработки вершины `v` все её предшественники (рёбра, входящие в `v`) уже обработаны, и мы знаем максимальное расстояние до `v`. Следовательно, можно применить динамическое программирование:

1. Получить топологический порядок вершин (например, алгоритмом Кана).
2. Инициализировать `dist` значением `INT_MIN` для всех вершин, а `dist[src] = 0`.
3. Пройти по вершинам в топологическом порядке. Для каждой вершины `u`, если она достижима (`dist[u] != INT_MIN`), то для каждого исходящего ребра `(u, v, w)` обновить `dist[v] = max(dist[v], dist[u] + w)`.

Это гарантирует, что мы рассмотрим все возможные пути и найдём максимальные расстояния.

**Наивный подход** (DFS всех путей) экспоненциален и неэффективен, поэтому рассматривается только эффективный метод.

---

## Алгоритм (пошагово)

1. Построить список смежности `adj` и массив `indegree` для всех вершин.
2. Найти топологический порядок с помощью алгоритма Кана:
   - Поместить все вершины с `indegree == 0` в очередь.
   - Пока очередь не пуста: извлечь вершину, добавить в `topoOrder`, уменьшить `indegree` её соседей; если `indegree` соседа стал 0, добавить его в очередь.
3. Инициализировать `dist` значением `INT_MIN` (например, `-(2**31)`), `dist[src] = 0`.
4. Для каждой вершины `u` в `topoOrder`:
   - Если `dist[u] == INT_MIN`, пропустить (вершина недостижима).
   - Для каждого ребра `(v, w)` из `adj[u]`:
     - `dist[v] = max(dist[v], dist[u] + w)`.
5. Вернуть `dist` (при выводе заменить `INT_MIN` на `INF`).

---

## Реализация на Python

```python
from collections import deque

def longest_path_dag(V, src, edges):
    # построение списка смежности и подсчёт входящих степеней
    adj = [[] for _ in range(V)]
    indegree = [0] * V
    for u, v, w in edges:
        adj[u].append((v, w))
        indegree[v] += 1

    # топологическая сортировка (алгоритм Кана)
    q = deque([i for i in range(V) if indegree[i] == 0])
    topo = []
    while q:
        u = q.popleft()
        topo.append(u)
        for v, _ in adj[u]:
            indegree[v] -= 1
            if indegree[v] == 0:
                q.append(v)

    # инициализация расстояний
    INT_MIN = -(2**31)
    dist = [INT_MIN] * V
    dist[src] = 0

    # DP по топологическому порядку
    for u in topo:
        if dist[u] == INT_MIN:
            continue
        for v, w in adj[u]:
            dist[v] = max(dist[v], dist[u] + w)

    return dist

# Пример
V = 5
src = 1
edges = [[0,1,1], [0,2,2], [1,4,4], [3,2,-1], [4,2,3], [4,3,6]]
ans = longest_path_dag(V, src, edges)
# Вывод: [INF, 0, 9, 10, 4]
print([ "INF" if x == -(2**31) else x for x in ans ])
```

---

## Сложность

- **Время:** O(V + E) — топологическая сортировка O(V+E) и один проход по всем рёбрам.
- **Память:** O(V + E) для хранения графа и вспомогательных массивов.

---

## Примечания

- Алгоритм работает только для DAG. Если граф содержит циклы, топологическая сортировка невозможна.
- Веса могут быть отрицательными, что не влияет на алгоритм (в отличие от Дейкстры).
- Если `src` не достижима до некоторых вершин, их расстояние остаётся `INT_MIN`.
- Топологический порядок может быть получен также через DFS (пост-порядок), но алгоритм Кана более нагляден.

---

## Связь с другими задачами

- **Кратчайший путь в DAG** — аналогично, только вместо `max` используется `min`. Это позволяет находить кратчайшие пути даже с отрицательными весами за O(V+E).
- **Топологическая сортировка** — основа алгоритма.
- **Динамическое программирование на графах** — общий подход для DAG.

---

## Заключение

Задача о самом длинном пути в DAG является классическим примером применения топологической сортировки и динамического программирования. Она эффективно решается за линейное время и используется в различных приложениях, таких как планирование задач, анализ зависимостей и оптимизация производственных процессов. Понимание этого алгоритма помогает освоить более сложные техники работы с графами.

---