
## Определение

**Алгоритм Рабина-Карпа** — это алгоритм поиска подстроки в тексте, использующий **хеширование** для быстрого сравнения шаблона с подстроками текста. Вместо посимвольного сравнения каждой подстроки (как в наивном алгоритме), он сравнивает хеш-значения. Это позволяет в среднем работать за линейное время, но в худшем случае (при коллизиях) может деградировать до O(n·m).

Алгоритм особенно полезен для поиска **множества паттернов** или в задачах, где требуется многократное сравнение подстрок.

---

## Постановка задачи

**Входные данные:**
- `text` — строка (текст) длиной n.
- `pattern` — строка (паттерн) длиной m (m ≤ n).

**Выход:** массив 0-индексированных позиций начала всех вхождений `pattern` в `text`.

---

## Идея решения

Алгоритм состоит из следующих шагов:

1. **Вычисление хеша паттерна** и хеша первого окна текста (длины m).
2. **Скольжение окна** по тексту и пересчёт хеша для каждого нового окна за O(1) с использованием **роллинг-хеша**.
3. **Сравнение хешей**: если хеши совпадают, выполняется **посимвольная проверка** для исключения ложных срабатываний (коллизий).
4. Если проверка успешна, добавляем индекс в результат.

### Хеш-функция

Для строки `s` длины m хеш вычисляется как:
```
hash(s) = (s[0] * d^(m-1) + s[1] * d^(m-2) + ... + s[m-1] * d^0) mod q
```
где:
- `d` — размер алфавита (например, 256 для ASCII или 26 для строчных букв),
- `q` — большое простое число (модуль), чтобы уменьшить коллизии и избежать переполнения.

### Роллинг-хеш

При переходе от окна `[i, i+m-1]` к `[i+1, i+m]` новый хеш вычисляется по формуле:
```
new_hash = ( (old_hash - text[i] * d^(m-1)) * d + text[i+m] ) mod q
```
То есть мы удаляем вклад первого символа (умноженный на `d^(m-1)`) и добавляем новый символ в конце.

---

## Алгоритм (пошагово)

1. Предварительно вычислить `h = d^(m-1) mod q`.
2. Вычислить хеш паттерна `p_hash` и хеш первого окна текста `t_hash`.
3. Для каждого окна `i` от 0 до `n-m`:
   - Если `p_hash == t_hash`, выполнить посимвольную проверку подстроки `text[i:i+m]` с `pattern`. Если совпадает, добавить `i` в результат.
   - Если `i < n-m`, пересчитать `t_hash` для следующего окна по формуле роллинг-хеша.
4. Вернуть список индексов.

---

## Реализация на Python

```python
def rabin_karp(text, pattern):
    d = 256          # размер алфавита (ASCII)
    q = 101          # простое число для модуля
    m = len(pattern)
    n = len(text)
    if m > n:
        return []

    # Вычисляем h = d^(m-1) % q
    h = 1
    for _ in range(m - 1):
        h = (h * d) % q

    # Хеш паттерна и первого окна
    p_hash = 0
    t_hash = 0
    for i in range(m):
        p_hash = (d * p_hash + ord(pattern[i])) % q
        t_hash = (d * t_hash + ord(text[i])) % q

    result = []
    for i in range(n - m + 1):
        if p_hash == t_hash:
            # Проверка на коллизию
            if text[i:i+m] == pattern:
                result.append(i)

        # Пересчёт хеша для следующего окна (если есть)
        if i < n - m:
            t_hash = ((t_hash - ord(text[i]) * h * d + ord(text[i + m])) % q
            if t_hash < 0:
                t_hash += q

    return result

# Пример
text = "geeksforgeeks"
pattern = "geeks"
print(rabin_karp(text, pattern))  # [0, 8]
```

---

## Сложность

- **Средний случай:** O(n + m) — хеши вычисляются за O(m) для первого окна и O(1) для каждого следующего, сравнение хешей O(1), посимвольная проверка происходит редко.
- **Худший случай:** O(n·m) — когда много коллизий (например, все хеши совпадают), и каждый раз выполняется полная проверка.
- **Память:** O(1) (не считая выходного массива).

---

## Примечания

- **Коллизии** неизбежны, поэтому после совпадения хешей всегда нужна посимвольная проверка.
- Выбор `d` и `q` влияет на частоту коллизий. Часто используют большие простые числа (`q = 10^9+7` или `2^64` с переполнением).
- Алгоритм хорошо параллелится и легко адаптируется для поиска множества паттернов (модифицируя хеш-функцию).
- По сравнению с KMP и Бойером-Муром, Рабин-Карп проще в реализации и эффективен для длинных текстов и коротких паттернов при хорошей хеш-функции.

---