
tags: #array #difference_array #prefix_sum

---

## Определение

Дан массив (или диапазон) длины `L`, изначально заполненный нулями. Выполняется `N` операций, каждая из которых увеличивает на 1 все элементы на отрезке `[l, r]` (включительно). Затем требуется ответить на `M` запросов: для заданной позиции `x` вывести, сколько раз она была увеличена.

Задача известна как **«Частотный анализ покрытия отрезков»** и решается с помощью **метода разностей** (difference array).

---

## Постановка задачи

**Входные данные:**
- Первая строка: `L, N, M` — длина диапазона (обычно от 1 до L), количество операций и количество запросов.
- Затем `N` строк: каждая содержит два числа `l` и `r` (1 ≤ l ≤ r ≤ L) — границы отрезка, который увеличивается на 1.
- Затем `M` строк: каждая содержит одно число `x` (1 ≤ x ≤ L) — позиция, для которой нужно вывести количество покрытий.

**Выходные данные:** для каждого запроса вывести число — сколько раз позиция `x` была включена в отрезки.

---

## Идея решения

Наивный подход — для каждой операции проходить по всем элементам отрезка и увеличивать их — займёт O(N·L), что слишком долго при больших значениях. Вместо этого используется **разностный массив (difference array)**.

### Разностный массив

Пусть `arr` — исходный массив (изначально нули). Создадим массив `diff` длины `L+2` (чтобы удобно обрабатывать границы). Для операции на отрезке `[l, r]`:
- `diff[l] += 1`
- `diff[r+1] -= 1`

После выполнения всех операций восстановим итоговый массив `result` с помощью префиксной суммы:
```
result[i] = result[i-1] + diff[i]   для i от 1 до L
```
Тогда `result[i]` будет содержать количество раз, которые позиция `i` была покрыта отрезками.

### Ответ на запросы

Поскольку мы уже вычислили `result` для всех позиций, то на запрос `x` просто выводим `result[x]`.

---

## Реализация

В приведённом коде используется массив `diff_arr` длины `L+2` (с запасом). Обратите внимание на индексацию: вводятся `l` и `r` в 1-индексации, а после обработки мы имеем массив, где `diff_arr[i]` после префиксной суммы даёт значение для позиции `i`.

```python
def range_frequency_queries():
    L, N, M = map(int, input().split())
    diff = [0] * (L + 2)          # массив разностей, размер с запасом
    
    # Обработка всех операций
    for _ in range(N):
        l, r = map(int, input().split())
        diff[l] += 1
        diff[r + 1] -= 1
    
    # Префиксная сумма для восстановления исходных значений
    for i in range(1, L + 2):
        diff[i] += diff[i - 1]    # теперь diff[i] хранит количество покрытий для позиции i
    
    # Ответы на запросы
    for _ in range(M):
        x = int(input())
        print(diff[x])
```

### Пояснение кода

- Размер `L+2` гарантирует, что при обращении к `diff[r+1]` мы не выйдем за границы (макс. r = L, значит r+1 = L+1, индекс L+1 допустим).
- После префиксной суммы `diff[i]` для i от 1 до L содержит искомые значения, а `diff[L+1]` может быть использовано для контроля (но не нужно).
- Запросы читаются и сразу выводится `diff[x]`.

---

## Сложность

- **Время:** O(N + L + M) — каждая операция обрабатывается за O(1), префиксная сумма за O(L), ответы за O(M).
- **Память:** O(L) для хранения разностного массива.

---

## Примечания

- Метод разностей особенно полезен, когда нужно выполнить множество операций инкремента на отрезках, а затем всего несколько запросов или все запросы в конце.
- В некоторых задачах операции могут быть разного типа (не только +1), тогда в разностном массиве сохраняется изменение, а после восстановления получается итоговое значение.
- Если запросы идут вперемежку с операциями, метод разностей не подходит — нужны деревья отрезков или Фенвика.

---